<?php

use Illuminate\Database\Seeder;

class KvedTableSeeder extends Seeder {

    public function run() {
        DB::table('kveds')->delete();

        $descriptions = [
            'Діяльність ресторанів, надання послуг мобільного харчування',
            'Постачання готових страв',
            'Обслуговування напоями',
            'Діяльність лікарняних закладів',
            'Інша діяльність щодо поводження з відходами',
            'Каналізація, відведення й очищення стічних вод',
            'Забір, очищення та постачання води',
            'Збирання, оброблення й видалення відходів; відновлення матеріалів',
            'n/Купівля та продаж власного нерухомого майна',
            'Надання в оренду й експлуатацію власного чи орендованого нерухомого майна',
            'Операції з нерухомим майном',
            'Операції з нерухомим майном за винагороду або на основі контракту',
            'Державне управління й оборона; обовязкове соціальне страхування',
            'Державне управління загального характеру; соціально-економічне управління',
            'Надання державних послуг суспільству в цілому',
            'Діяльність у сфері обовязкового соціального страхування',
        ];

        $kveds = [];
        for ($i = 0; $i <= 99; $i++) {
            for ($j = 0; $j <= 99; $j++) {
                $kveds[] = [ 'kved' => $i . '.' . $j, 'edited' => 1, 'operation' => 'update', 'description' => $descriptions[array_rand($descriptions)], 'created_at' => new DateTime, 'updated_at' => new DateTime];
            }
        }

        DB::table('kveds')->insert($kveds);
    }

}
